SpenceKonde/megaTinyCore/megaavr/extras/development/boards.txt
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx27o.build.bootload=
atx27o.build.printfabr=
atx27o.build.attachabr=
atx27o.build.wireabr=
atx27o.build.pwmabr=

################################
# CHIP                         #
################################
atx27o.menu.chip.3217=ATtiny3217
atx27o.menu.chip.3217.build.board=AVR_ATtiny3217
atx27o.menu.chip.3217.build.attiny=3217
atx27o.menu.chip.3217.upload.maximum_size=32768
atx27o.menu.chip.3217.upload.maximum_data_size=2048
atx27o.menu.chip.3217.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atx27o.menu.chip.3217.bootloader.TCD0CFG_serialupdi=4:0x00
atx27o.menu.chip.1617=ATtiny1617
atx27o.menu.chip.1617.build.board=AVR_ATtiny1617
atx27o.menu.chip.1617.build.attiny=1617
atx27o.menu.chip.1617.upload.maximum_size=16384
atx27o.menu.chip.1617.upload.maximum_data_size=2048
atx27o.menu.chip.1617.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atx27o.menu.chip.1617.bootloader.TCD0CFG_serialupdi=4:0x00
atx27o.menu.chip.817=ATtiny817
atx27o.menu.chip.817.build.board=AVR_ATtiny817
atx27o.menu.chip.817.build.attiny=817
atx27o.menu.chip.817.upload.maximum_size=8192
atx27o.menu.chip.817.upload.maximum_data_size=512
atx27o.menu.chip.817.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atx27o.menu.chip.817.bootloader.TCD0CFG_serialupdi=4:0x00
atx27o.menu.chip.417=ATtiny417
atx27o.menu.chip.417.build.board=AVR_ATtiny417
atx27o.menu.chip.417.build.attiny=417
atx27o.menu.chip.417.upload.maximum_size=4096
atx27o.menu.chip.417.upload.maximum_data_size=256
atx27o.menu.chip.417.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atx27o.menu.chip.417.bootloader.TCD0CFG_serialupdi=4:0x00
atx27o.menu.chip.3227=ATtiny3227
atx27o.menu.chip.3227.bootloader.altreset=11
atx27o.menu.chip.3227.build.board=AVR_ATtiny3227
atx27o.menu.chip.3227.build.millistimer=B1
atx27o.menu.chip.3227.build.attiny=3227
atx27o.menu.chip.3227.upload.maximum_size=32768
atx27o.menu.chip.3227.upload.maximum_data_size=3072
atx27o.menu.chip.3227.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atx27o.menu.chip.1627=ATtiny1627
atx27o.menu.chip.1627.bootloader.altreset=11
atx27o.menu.chip.1627.build.board=AVR_ATtiny1627
atx27o.menu.chip.1627.build.millistimer=B1
atx27o.menu.chip.1627.build.attiny=1627
atx27o.menu.chip.1627.upload.maximum_size=16384
atx27o.menu.chip.1627.upload.maximum_data_size=2048
atx27o.menu.chip.1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atx27o.menu.chip.827=ATtiny827
atx27o.menu.chip.827.bootloader.altreset=11
atx27o.menu.chip.827.build.board=AVR_ATtiny827
atx27o.menu.chip.827.build.millistimer=B1
atx27o.menu.chip.827.build.attiny=827
atx27o.menu.chip.827.upload.maximum_size=8192
atx27o.menu.chip.827.upload.maximum_data_size=1024
atx27o.menu.chip.827.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atx27o.menu.chip.427=ATtiny427
atx27o.menu.chip.427.bootloader.altreset=11
atx27o.menu.chip.427.build.board=AVR_ATtiny427
atx27o.menu.chip.427.build.millistimer=B1
atx27o.menu.chip.427.build.attiny=427
atx27o.menu.chip.427.upload.maximum_size=4096
atx27o.menu.chip.427.upload.maximum_data_size=512
atx27o.menu.chip.427.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atx27o.menu.chip.1607=ATtiny1607
atx27o.menu.chip.1607.build.board=AVR_ATtiny1607
atx27o.menu.chip.1607.build.attiny=1607
atx27o.menu.chip.1607.build.millistimer=A0
atx27o.menu.chip.1607.upload.maximum_size=16384
atx27o.menu.chip.1607.upload.maximum_data_size=1024
atx27o.menu.chip.807=ATtiny807
atx27o.menu.chip.807.build.board=AVR_ATtiny807
atx27o.menu.chip.807.build.attiny=807
atx27o.menu.chip.807.build.millistimer=A0
atx27o.menu.chip.807.upload.maximum_size=8192
atx27o.menu.chip.807.upload.maximum_data_size=512

################################
# CLOCK SOURCE                 #
################################
atx27o.menu.clock.20internal=20 MHz internal
atx27o.menu.clock.16internal=16 MHz internal
atx27o.menu.clock.10internal=10 MHz internal
atx27o.menu.clock.8internal=8 MHz internal
atx27o.menu.clock.5internal=5 MHz internal
atx27o.menu.clock.4internal=4 MHz internal
atx27o.menu.clock.1internal=1 MHz internal
atx27o.menu.clock.20internaltuned=20 MHz internal - tuned
atx27o.menu.clock.16internaltuned=16 MHz internal - tuned
atx27o.menu.clock.12internaltuned=12 MHz internal - tuned
atx27o.menu.clock.10internaltuned=10 MHz internal - tuned
atx27o.menu.clock.8internaltuned=8 MHz internal - tuned
atx27o.menu.clock.6internaltuned=6 MHz internal - tuned
atx27o.menu.clock.5internaltuned=5 MHz internal - tuned
atx27o.menu.clock.4internaltuned=4 MHz internal - tuned
atx27o.menu.clock.2internaltuned=2 MHz internal - tuned
atx27o.menu.clock.1internaltuned=1 MHz internal - tuned
atx27o.menu.clock.20extclock=20 MHz external clock
atx27o.menu.clock.16extclock=16 MHz external clock
atx27o.menu.clock.12extclock=12 MHz external clock
atx27o.menu.clock.10extclock=10 MHz external clock
atx27o.menu.clock.8extclock=8 MHz external clock
atx27o.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atx27o.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atx27o.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx27o.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx27o.menu.clock.24extclock=24 MHz external clock - overclocked
atx27o.menu.clock.25extclock=25 MHz external clock - overclocked
atx27o.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atx27o.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atx27o.menu.clock.20internal.build.speed=20
atx27o.menu.clock.20internal.build.clocksource=0
atx27o.menu.clock.16internal.build.speed=16
atx27o.menu.clock.16internal.build.clocksource=0
atx27o.menu.clock.10internal.build.speed=10
atx27o.menu.clock.10internal.build.clocksource=0
atx27o.menu.clock.8internal.build.speed=8
atx27o.menu.clock.8internal.build.clocksource=0
atx27o.menu.clock.5internal.build.speed=5
atx27o.menu.clock.5internal.build.clocksource=0
atx27o.menu.clock.4internal.build.speed=4
atx27o.menu.clock.4internal.build.clocksource=0
atx27o.menu.clock.1internal.build.speed=1
atx27o.menu.clock.1internal.build.clocksource=0
atx27o.menu.clock.20extclock.build.speed=20
atx27o.menu.clock.20extclock.build.clocksource=2
atx27o.menu.clock.16extclock.build.speed=16
atx27o.menu.clock.16extclock.build.clocksource=2
atx27o.menu.clock.12extclock.build.speed=12
atx27o.menu.clock.12extclock.build.clocksource=2
atx27o.menu.clock.10extclock.build.speed=10
atx27o.menu.clock.10extclock.build.clocksource=2
atx27o.menu.clock.8extclock.build.speed=8
atx27o.menu.clock.8extclock.build.clocksource=2
atx27o.menu.clock.24extclock.build.speed=24
atx27o.menu.clock.24extclock.build.clocksource=2
atx27o.menu.clock.25extclock.build.speed=24
atx27o.menu.clock.25extclock.build.clocksource=2
atx27o.menu.clock.30extclock.build.speed=30
atx27o.menu.clock.30extclock.build.clocksource=2
atx27o.menu.clock.32extclock.build.speed=32
atx27o.menu.clock.32extclock.build.clocksource=2
atx27o.menu.clock.1internaltuned.build.speed=1
atx27o.menu.clock.1internaltuned.build.clocksource=0
atx27o.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.2internaltuned.build.speed=2
atx27o.menu.clock.2internaltuned.build.clocksource=0
atx27o.menu.clock.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.4internaltuned.build.speed=4
atx27o.menu.clock.4internaltuned.build.clocksource=0
atx27o.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.5internaltuned.build.speed=5
atx27o.menu.clock.5internaltuned.build.clocksource=0
atx27o.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.6internaltuned.build.speed=6
atx27o.menu.clock.6internaltuned.build.clocksource=0
atx27o.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.8internaltuned.build.speed=8
atx27o.menu.clock.8internaltuned.build.clocksource=0
atx27o.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.10internaltuned.build.speed=10
atx27o.menu.clock.10internaltuned.build.clocksource=0
atx27o.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.12internaltuned.build.speed=12
atx27o.menu.clock.12internaltuned.build.clocksource=0
atx27o.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.12internaltuned.bootloader.OSCCFG={bootloader.osccfg24}
atx27o.menu.clock.16internaltuned.build.speed=16
atx27o.menu.clock.16internaltuned.build.clocksource=0
atx27o.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.20internaltuned.build.speed=20
atx27o.menu.clock.20internaltuned.build.clocksource=0
atx27o.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.24internaltuned.build.speed=24
atx27o.menu.clock.24internaltuned.build.clocksource=0
atx27o.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.25internaltuned.build.speed=25
atx27o.menu.clock.25internaltuned.build.clocksource=0
atx27o.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.30internaltuned.build.speed=30
atx27o.menu.clock.30internaltuned.build.clocksource=0
atx27o.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.32internaltuned.build.speed=32
atx27o.menu.clock.32internaltuned.build.clocksource=0
atx27o.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx27o.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atx27o.menu.clock.20internal.bootloader.OSCCFG=0x02
atx27o.menu.clock.10internal.bootloader.OSCCFG=0x02
atx27o.menu.clock.5internal.bootloader.OSCCFG=0x02

################################
# BOD VOLTAGE                  #
################################
atx27o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx27o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx27o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx27o.menu.bodvoltage.2v1=2.1V (Unofficial)
atx27o.menu.bodvoltage.2v9=2.9V (Unofficial)
atx27o.menu.bodvoltage.3v3=3.3V (Unofficial)
atx27o.menu.bodvoltage.3v7=3.7V (Unofficial)
atx27o.menu.bodvoltage.4v0=4.0V (Unofficial)
atx27o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx27o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atx27o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx27o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx27o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx27o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx27o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx27o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

################################
# BOD MODE                     #
################################
atx27o.menu.bodmode.disabled=Disabled/Disabled
atx27o.menu.bodmode.enabled=Enabled/Enabled
atx27o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx27o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx27o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx27o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx27o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx27o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx27o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx27o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx27o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx27o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx27o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx27o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx27o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx27o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx27o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx27o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

################################
# EEPROM RETAIN                #
################################
atx27o.menu.eesave.enable=EEPROM retained
atx27o.menu.eesave.enable.bootloader.eesavebit=1
atx27o.menu.eesave.disable=EEPROM not retained
atx27o.menu.eesave.disable.bootloader.eesavebit=0

################################
# MILLIS TIMER                 #
################################
atx27o.menu.millis.enabled=Enabled (default timer)
atx27o.menu.millis.disabled=Disabled (saves flash)
atx27o.menu.millis.timera=TCA0 (default on 0-series)
atx27o.menu.millis.timerd=TCD0 (1-series only, default there)
atx27o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atx27o.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
atx27o.menu.millis.rtc=RTC (no micros)
atx27o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atx27o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atx27o.menu.millis.disabled.build.millistimer=NONE
atx27o.menu.millis.timera.build.millistimer=A0
atx27o.menu.millis.timerd.build.millistimer=D0
atx27o.menu.millis.timerb0.build.millistimer=B0
atx27o.menu.millis.timerb1.build.millistimer=B1
atx27o.menu.millis.rtc.build.millistimer=RTC
atx27o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx27o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

################################
# TWI OPTIONS                  #
################################
atx27o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx27o.menu.wiremode.mors.build.wire=MORS
atx27o.menu.wiremode.mands=Master and Slave
atx27o.menu.wiremode.mands.build.wire=MANDS

################################
# BUILD PARAMETERS             #
################################
atxy6o.build.text_section_start=.text=0x0
atxy6o.build.millistimer=D0
atxy6o.build.bootload=
atxy6o.build.board=AVR_ATtinyxy7
atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.variant=txy7
atxy6o.build.tuned=
atxy6o.build.printf=
atxy6o.build.wire=MORS
atxy6o.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.build.extra_flags=-DARDUINO_attinyxy7 {build.tuned}
atxy6o.build.export_merged_output=false

################################
# UPLOAD VIA UPDI              #
################################
atxy6o.upload.tool=avrdude
atxy6o.upload.workaround=
atxy6o.upload.prog_interlock=

################################
# BOOTLOADING PARAMETERS       #
################################
atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.OSCCFG=0x01
atxy6o.bootloader.TCD0CFG_avrdude=
atxy6o.bootloader.TCD0CFG_serialupdi=
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x00
atxy6o.bootloader.resetpinbits=01
atxy6o.bootloader.avrdudestring=
atxy6o.bootloader.serialupdistring=-aerase
atxy6o.bootloader.altreset=Alt reset pin not supported on 0/1-series.
atxy6o.bootloader.tool=avrdude

