SpenceKonde/megaTinyCore/megaavr/extras/development/boards.txt
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
microchipo.build.bootload=
microchipo.build.printfabr=
microchipo.build.attachabr=
microchipo.build.wireabr=
microchipo.build.pwmabr=

################################
# CHIP                         #
################################
microchipo.menu.chip.3217=ATtiny3217
microchipo.menu.chip.3217.build.board=AVR_ATtiny3217
microchipo.menu.chip.3217.build.attiny=3217
microchipo.menu.chip.3217.upload.maximum_size=32768
microchipo.menu.chip.3217.upload.maximum_data_size=2048
microchipo.menu.chip.3217.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.menu.chip.3217.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.menu.chip.1617=ATtiny1617
microchipo.menu.chip.1617.build.board=AVR_ATtiny1617
microchipo.menu.chip.1617.build.attiny=1617
microchipo.menu.chip.1617.upload.maximum_size=16384
microchipo.menu.chip.1617.upload.maximum_data_size=2048
microchipo.menu.chip.1617.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.menu.chip.1617.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.menu.chip.817=ATtiny817
microchipo.menu.chip.817.build.board=AVR_ATtiny817
microchipo.menu.chip.817.build.attiny=817
microchipo.menu.chip.817.upload.maximum_size=8192
microchipo.menu.chip.817.upload.maximum_data_size=512
microchipo.menu.chip.817.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.menu.chip.817.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.menu.chip.417=ATtiny417
microchipo.menu.chip.417.build.board=AVR_ATtiny417
microchipo.menu.chip.417.build.attiny=417
microchipo.menu.chip.417.upload.maximum_size=4096
microchipo.menu.chip.417.upload.maximum_data_size=256
microchipo.menu.chip.417.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.menu.chip.417.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.menu.chip.3227=ATtiny3227
microchipo.menu.chip.3227.bootloader.altreset=11
microchipo.menu.chip.3227.build.board=AVR_ATtiny3227
microchipo.menu.chip.3227.build.millistimer=B1
microchipo.menu.chip.3227.build.attiny=3227
microchipo.menu.chip.3227.upload.maximum_size=32768
microchipo.menu.chip.3227.upload.maximum_data_size=3072
microchipo.menu.chip.3227.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchipo.menu.chip.1627=ATtiny1627
microchipo.menu.chip.1627.bootloader.altreset=11
microchipo.menu.chip.1627.build.board=AVR_ATtiny1627
microchipo.menu.chip.1627.build.millistimer=B1
microchipo.menu.chip.1627.build.attiny=1627
microchipo.menu.chip.1627.upload.maximum_size=16384
microchipo.menu.chip.1627.upload.maximum_data_size=2048
microchipo.menu.chip.1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchipo.menu.chip.827=ATtiny827
microchipo.menu.chip.827.bootloader.altreset=11
microchipo.menu.chip.827.build.board=AVR_ATtiny827
microchipo.menu.chip.827.build.millistimer=B1
microchipo.menu.chip.827.build.attiny=827
microchipo.menu.chip.827.upload.maximum_size=8192
microchipo.menu.chip.827.upload.maximum_data_size=1024
microchipo.menu.chip.827.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchipo.menu.chip.427=ATtiny427
microchipo.menu.chip.427.bootloader.altreset=11
microchipo.menu.chip.427.build.board=AVR_ATtiny427
microchipo.menu.chip.427.build.millistimer=B1
microchipo.menu.chip.427.build.attiny=427
microchipo.menu.chip.427.upload.maximum_size=4096
microchipo.menu.chip.427.upload.maximum_data_size=512
microchipo.menu.chip.427.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchipo.menu.chip.1607=ATtiny1607
microchipo.menu.chip.1607.build.board=AVR_ATtiny1607
microchipo.menu.chip.1607.build.attiny=1607
microchipo.menu.chip.1607.build.millistimer=A0
microchipo.menu.chip.1607.upload.maximum_size=16384
microchipo.menu.chip.1607.upload.maximum_data_size=1024
microchipo.menu.chip.807=ATtiny807
microchipo.menu.chip.807.build.board=AVR_ATtiny807
microchipo.menu.chip.807.build.attiny=807
microchipo.menu.chip.807.build.millistimer=A0
microchipo.menu.chip.807.upload.maximum_size=8192
microchipo.menu.chip.807.upload.maximum_data_size=512

################################
# CLOCK SOURCE                 #
################################
microchipo.menu.clock.20internal=20 MHz internal
microchipo.menu.clock.16internal=16 MHz internal
microchipo.menu.clock.10internal=10 MHz internal
microchipo.menu.clock.8internal=8 MHz internal
microchipo.menu.clock.5internal=5 MHz internal
microchipo.menu.clock.4internal=4 MHz internal
microchipo.menu.clock.1internal=1 MHz internal
microchipo.menu.clock.20internaltuned=20 MHz internal - tuned
microchipo.menu.clock.16internaltuned=16 MHz internal - tuned
microchipo.menu.clock.12internaltuned=12 MHz internal - tuned
microchipo.menu.clock.10internaltuned=10 MHz internal - tuned
microchipo.menu.clock.8internaltuned=8 MHz internal - tuned
microchipo.menu.clock.6internaltuned=6 MHz internal - tuned
microchipo.menu.clock.5internaltuned=5 MHz internal - tuned
microchipo.menu.clock.4internaltuned=4 MHz internal - tuned
microchipo.menu.clock.2internaltuned=2 MHz internal - tuned
microchipo.menu.clock.1internaltuned=1 MHz internal - tuned
microchipo.menu.clock.20extclock=20 MHz external clock
microchipo.menu.clock.16extclock=16 MHz external clock
microchipo.menu.clock.12extclock=12 MHz external clock
microchipo.menu.clock.10extclock=10 MHz external clock
microchipo.menu.clock.8extclock=8 MHz external clock
microchipo.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
microchipo.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
microchipo.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clock.24extclock=24 MHz external clock - overclocked
microchipo.menu.clock.25extclock=25 MHz external clock - overclocked
microchipo.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
microchipo.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
microchipo.menu.clock.20internal.build.speed=20
microchipo.menu.clock.20internal.build.clocksource=0
microchipo.menu.clock.16internal.build.speed=16
microchipo.menu.clock.16internal.build.clocksource=0
microchipo.menu.clock.10internal.build.speed=10
microchipo.menu.clock.10internal.build.clocksource=0
microchipo.menu.clock.8internal.build.speed=8
microchipo.menu.clock.8internal.build.clocksource=0
microchipo.menu.clock.5internal.build.speed=5
microchipo.menu.clock.5internal.build.clocksource=0
microchipo.menu.clock.4internal.build.speed=4
microchipo.menu.clock.4internal.build.clocksource=0
microchipo.menu.clock.1internal.build.speed=1
microchipo.menu.clock.1internal.build.clocksource=0
microchipo.menu.clock.20extclock.build.speed=20
microchipo.menu.clock.20extclock.build.clocksource=2
microchipo.menu.clock.16extclock.build.speed=16
microchipo.menu.clock.16extclock.build.clocksource=2
microchipo.menu.clock.12extclock.build.speed=12
microchipo.menu.clock.12extclock.build.clocksource=2
microchipo.menu.clock.10extclock.build.speed=10
microchipo.menu.clock.10extclock.build.clocksource=2
microchipo.menu.clock.8extclock.build.speed=8
microchipo.menu.clock.8extclock.build.clocksource=2
microchipo.menu.clock.24extclock.build.speed=24
microchipo.menu.clock.24extclock.build.clocksource=2
microchipo.menu.clock.25extclock.build.speed=24
microchipo.menu.clock.25extclock.build.clocksource=2
microchipo.menu.clock.30extclock.build.speed=30
microchipo.menu.clock.30extclock.build.clocksource=2
microchipo.menu.clock.32extclock.build.speed=32
microchipo.menu.clock.32extclock.build.clocksource=2
microchipo.menu.clock.1internaltuned.build.speed=1
microchipo.menu.clock.1internaltuned.build.clocksource=0
microchipo.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.2internaltuned.build.speed=2
microchipo.menu.clock.2internaltuned.build.clocksource=0
microchipo.menu.clock.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.4internaltuned.build.speed=4
microchipo.menu.clock.4internaltuned.build.clocksource=0
microchipo.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.5internaltuned.build.speed=5
microchipo.menu.clock.5internaltuned.build.clocksource=0
microchipo.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.6internaltuned.build.speed=6
microchipo.menu.clock.6internaltuned.build.clocksource=0
microchipo.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.8internaltuned.build.speed=8
microchipo.menu.clock.8internaltuned.build.clocksource=0
microchipo.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.10internaltuned.build.speed=10
microchipo.menu.clock.10internaltuned.build.clocksource=0
microchipo.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.12internaltuned.build.speed=12
microchipo.menu.clock.12internaltuned.build.clocksource=0
microchipo.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.12internaltuned.bootloader.OSCCFG={bootloader.osccfg24}
microchipo.menu.clock.16internaltuned.build.speed=16
microchipo.menu.clock.16internaltuned.build.clocksource=0
microchipo.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.20internaltuned.build.speed=20
microchipo.menu.clock.20internaltuned.build.clocksource=0
microchipo.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.24internaltuned.build.speed=24
microchipo.menu.clock.24internaltuned.build.clocksource=0
microchipo.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.25internaltuned.build.speed=25
microchipo.menu.clock.25internaltuned.build.clocksource=0
microchipo.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.30internaltuned.build.speed=30
microchipo.menu.clock.30internaltuned.build.clocksource=0
microchipo.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.32internaltuned.build.speed=32
microchipo.menu.clock.32internaltuned.build.clocksource=0
microchipo.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.20internal.bootloader.OSCCFG=0x02
microchipo.menu.clock.10internal.bootloader.OSCCFG=0x02
microchipo.menu.clock.5internal.bootloader.OSCCFG=0x02

################################
# BOD VOLTAGE                  #
################################
microchipo.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchipo.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchipo.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchipo.menu.bodvoltage.2v1=2.1V (Unofficial)
microchipo.menu.bodvoltage.2v9=2.9V (Unofficial)
microchipo.menu.bodvoltage.3v3=3.3V (Unofficial)
microchipo.menu.bodvoltage.3v7=3.7V (Unofficial)
microchipo.menu.bodvoltage.4v0=4.0V (Unofficial)
microchipo.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchipo.menu.bodvoltage.2v1.bootloader.bodlevbits=001
microchipo.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchipo.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchipo.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchipo.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchipo.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchipo.menu.bodvoltage.4v2.bootloader.bodlevbits=111

################################
# BOD MODE                     #
################################
microchipo.menu.bodmode.disabled=Disabled/Disabled
microchipo.menu.bodmode.enabled=Enabled/Enabled
microchipo.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchipo.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchipo.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchipo.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchipo.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchipo.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchipo.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchipo.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchipo.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchipo.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchipo.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchipo.menu.bodmode.samplefast.bootloader.bodmodebits=01010
microchipo.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
microchipo.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchipo.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchipo.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

################################
# EEPROM RETAIN                #
################################
microchipo.menu.eesave.enable=EEPROM retained
microchipo.menu.eesave.enable.bootloader.eesavebit=1
microchipo.menu.eesave.disable=EEPROM not retained
microchipo.menu.eesave.disable.bootloader.eesavebit=0

################################
# MILLIS TIMER                 #
################################
microchipo.menu.millis.enabled=Enabled (default timer)
microchipo.menu.millis.disabled=Disabled (saves flash)
microchipo.menu.millis.timera=TCA0 (default on 0-series)
microchipo.menu.millis.timerd=TCD0 (1-series only, default there)
microchipo.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
microchipo.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
microchipo.menu.millis.rtc=RTC (no micros)
microchipo.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
microchipo.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
microchipo.menu.millis.disabled.build.millistimer=NONE
microchipo.menu.millis.timera.build.millistimer=A0
microchipo.menu.millis.timerd.build.millistimer=D0
microchipo.menu.millis.timerb0.build.millistimer=B0
microchipo.menu.millis.timerb1.build.millistimer=B1
microchipo.menu.millis.rtc.build.millistimer=RTC
microchipo.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
microchipo.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

################################
# TWI OPTIONS                  #
################################
microchipo.menu.wiremode.mors=Master or Slave (saves flash and RAM)
microchipo.menu.wiremode.mors.build.wire=MORS
microchipo.menu.wiremode.mands=Master and Slave
microchipo.menu.wiremode.mands.build.wire=MANDS
